In [2]:
import numpy as np
import pandas as pd

In [3]:
labels = ['a','b','c']
my_data = [10,20,30]
arr = np.array(my_data)
d = {'a':10,'b':20,'c':30}

In [4]:
pd.Series(data=my_data)

0    10
1    20
2    30
dtype: int64

In [5]:
pd.Series(data=my_data,index=labels)

a    10
b    20
c    30
dtype: int64

In [6]:
pd.Series(arr,labels)

a    10
b    20
c    30
dtype: int32

In [7]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [8]:
ser1 = pd.Series([1,2,3],['Tommy','Tom','Jack'])

In [9]:
ser1

Tommy    1
Tom      2
Jack     3
dtype: int64

In [10]:
ser2 = pd.Series([3,2,4],['Jack','Tommy','Kitty'])

In [11]:
ser2

Jack     3
Tommy    2
Kitty    4
dtype: int64

In [12]:
ser1+ser2

Jack     6.0
Kitty    NaN
Tom      NaN
Tommy    3.0
dtype: float64

In [13]:
from numpy.random import randn

In [14]:
np.random.seed(101)

In [15]:
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [16]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [17]:
df[['X','Y']]

          X         Y
A  0.628133  0.907969
B -0.319318 -0.848077
C  0.740122  0.528813
D -0.758872 -0.933237
E  1.978757  2.605967

In [18]:
df['new'] = df['X'] + df['Y']

In [19]:
df['newnew'] = [1,2,3,4,'d']

In [20]:
df

          W         X         Y         Z       new newnew
A  2.706850  0.628133  0.907969  0.503826  1.536102      1
B  0.651118 -0.319318 -0.848077  0.605965 -1.167395      2
C -2.018168  0.740122  0.528813 -0.589001  1.268936      3
D  0.188695 -0.758872 -0.933237  0.955057 -1.692109      4
E  0.190794  1.978757  2.605967  0.683509  4.584725      d

In [21]:
df.drop('new',axis=1,inplace=True)

In [22]:
df

          W         X         Y         Z newnew
A  2.706850  0.628133  0.907969  0.503826      1
B  0.651118 -0.319318 -0.848077  0.605965      2
C -2.018168  0.740122  0.528813 -0.589001      3
D  0.188695 -0.758872 -0.933237  0.955057      4
E  0.190794  1.978757  2.605967  0.683509      d

In [23]:
df.iloc[0]

W          2.70685
X         0.628133
Y         0.907969
Z         0.503826
newnew           1
Name: A, dtype: object

In [24]:
df.loc['A']['Y']

0.9079694464765431

In [25]:
df.loc[['A','C'],['X','Z']]

          X         Z
A  0.628133  0.503826
C  0.740122 -0.589001

In [26]:
df > 0

       W      X      Y      Z  newnew
A   True   True   True   True    True
B   True  False  False   True    True
C  False   True   True  False    True
D   True  False  False   True    True
E   True   True   True   True    True

In [27]:
booldf = df > 0

In [28]:
booldf

       W      X      Y      Z  newnew
A   True   True   True   True    True
B   True  False  False   True    True
C  False   True   True  False    True
D   True  False  False   True    True
E   True   True   True   True    True

In [29]:
df[booldf]

          W         X         Y         Z newnew
A  2.706850  0.628133  0.907969  0.503826      1
B  0.651118       NaN       NaN  0.605965      2
C       NaN  0.740122  0.528813       NaN      3
D  0.188695       NaN       NaN  0.955057      4
E  0.190794  1.978757  2.605967  0.683509      d

In [30]:
newind = "NY OR AA BB CC".split()

In [31]:
newind

['NY', 'OR', 'AA', 'BB', 'CC']

In [32]:
df['States'] = newind

In [33]:
df

          W         X         Y         Z newnew States
A  2.706850  0.628133  0.907969  0.503826      1     NY
B  0.651118 -0.319318 -0.848077  0.605965      2     OR
C -2.018168  0.740122  0.528813 -0.589001      3     AA
D  0.188695 -0.758872 -0.933237  0.955057      4     BB
E  0.190794  1.978757  2.605967  0.683509      d     CC

In [34]:
df.set_index("States")

               W         X         Y         Z newnew
States
NY      2.706850  0.628133  0.907969  0.503826      1
OR      0.651118 -0.319318 -0.848077  0.605965      2
AA     -2.018168  0.740122  0.528813 -0.589001      3
BB      0.188695 -0.758872 -0.933237  0.955057      4
CC      0.190794  1.978757  2.605967  0.683509      d

In [35]:
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
print(hier_index)
hier_index = pd.MultiIndex.from_tuples(hier_index)
print(hier_index)

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]
MultiIndex(levels=[['G1', 'G2'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 0, 1, 2]])

In [36]:
df = pd.DataFrame(randn(6,2),hier_index,['A','B'])

In [37]:
df

             A         B
G1 1  0.302665  1.693723
   2 -1.706086 -1.159119
   3 -0.134841  0.390528
G2 1  0.166905  0.184502
   2  0.807706  0.072960
   3  0.638787  0.329646

In [38]:
df.loc['G1']

          A         B
1  0.302665  1.693723
2 -1.706086 -1.159119
3 -0.134841  0.390528

In [39]:
df.index.names = ["Group","Num"]

In [40]:
df

                  A         B
Group Num
G1    1    0.302665  1.693723
      2   -1.706086 -1.159119
      3   -0.134841  0.390528
G2    1    0.166905  0.184502
      2    0.807706  0.072960
      3    0.638787  0.329646

In [41]:
df.loc['G2'].loc[2]['B']

0.072959675317038689

In [42]:
df.xs(2,level="Num")

              A         B
Group
G1    -1.706086 -1.159119
G2     0.807706  0.072960

In [43]:
d = {'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]}

In [44]:
df = pd.DataFrame(d)

In [45]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [46]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [47]:
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [48]:
df.fillna(value="FILL")

      A     B  C
0     1     5  1
1     2  FILL  2
2  FILL  FILL  3

In [49]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [50]:
data = {"Company":["Apple","Apple","GOOGLE","GOOGLE","MS","MS"],
       "Person":["Tommy","Sam","Peter","Jack","Alfred","Carl"],
       "Sales":[123,123,456,456,678,678]}

In [51]:
df = pd.DataFrame(data)

In [52]:
df

  Company  Person  Sales
0   Apple   Tommy    123
1   Apple     Sam    123
2  GOOGLE   Peter    456
3  GOOGLE    Jack    456
4      MS  Alfred    678
5      MS    Carl    678

In [53]:
byComp= df.groupby("Company")

In [54]:
byComp.mean()

         Sales
Company
Apple      123
GOOGLE     456
MS         678

In [55]:
byComp.sum()

         Sales
Company
Apple      246
GOOGLE     912
MS        1356

In [56]:
byComp.std()

         Sales
Company
Apple      0.0
GOOGLE     0.0
MS         0.0

In [57]:
byComp.sum().loc['MS']

Sales    1356
Name: MS, dtype: int64

In [58]:
df.groupby("Company").sum().loc["GOOGLE"]

Sales    912
Name: GOOGLE, dtype: int64

In [59]:
df.groupby("Company").max()

        Person  Sales
Company
Apple    Tommy    123
GOOGLE   Peter    456
MS        Carl    678

In [60]:
df.groupby("Company").describe().transpose()

Company      Apple  GOOGLE     MS
Sales count    2.0     2.0    2.0
      mean   123.0   456.0  678.0
      std      0.0     0.0    0.0
      min    123.0   456.0  678.0
      25%    123.0   456.0  678.0
      50%    123.0   456.0  678.0
      75%    123.0   456.0  678.0
      max    123.0   456.0  678.0

In [61]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])

In [62]:
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7])

In [63]:
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

In [64]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [65]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [66]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [67]:
pd.concat([df1,df2,df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [68]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})

In [69]:
left

    A   B key
0  A0  B0  K0
1  A1  B1  K1
2  A2  B2  K2
3  A3  B3  K3

In [70]:
right

    C   D key
0  C0  D0  K0
1  C1  D1  K1
2  C2  D2  K2
3  C3  D3  K3

In [71]:
pd.merge(left,right)

    A   B key   C   D
0  A0  B0  K0  C0  D0
1  A1  B1  K1  C1  D1
2  A2  B2  K2  C2  D2
3  A3  B3  K3  C3  D3

In [72]:
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [78]:
df["col2"].unique()

array([444, 555, 666], dtype=int64)

In [79]:
df["col2"].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [80]:
def times3(x):
    return x*3

In [81]:
df.apply(times3)

   col1  col2       col3
0     3  1332  abcabcabc
1     6  1665  defdefdef
2     9  1998  ghighighi
3    12  1332  xyzxyzxyz

In [82]:
df['col2'].apply(lambda x:x*2)

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

In [85]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [86]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [89]:
df.sort_values('col3')

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [90]:
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [91]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)

In [92]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [94]:
df.pivot_table(values="D",index=["A","B"],columns='C')

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

In [96]:
pd.read_csv("example")

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [102]:
df = pd.read_csv("example")

In [104]:
df.to_csv("My_output",index=False)